; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-31)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 31
2. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 26 of 31
3. (pick ball11 roomb right)
   deleted: (at ball11 roomb) (free right)
   added: (carry ball11 right)
   goals met: 26 of 31
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 31
5. (drop ball11 rooma right)
   deleted: (carry ball11 right)
   added: (at ball11 rooma) (free right)
   goals met: 27 of 31
6. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 28 of 31
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 31
8. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 28 of 31
9. (pick ball22 room3 left)
   deleted: (at ball22 room3) (free left)
   added: (carry ball22 left)
   goals met: 28 of 31
10. (pick ball21 room3 right)
   deleted: (at ball21 room3) (free right)
   added: (carry ball21 right)
   goals met: 28 of 31
11. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 28 of 31
12. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 29 of 31
13. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 30 of 31
14. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 30 of 31
15. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 30 of 31
16. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 30 of 31
17. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 31 of 31
